export const MOCK_BLACKLIST = [
  {
    id: 1,
    name: '욕설 플레이어 모음',
    createdBy: '방울토마토라면',
    createdAt: '2024-11-25',
    add: 1294,
    bad: 153,
  },
  {
    id: 2,
    name: '숙코 모음',
    createdBy: '남양쮸강아지우',
    createdAt: '2024-11-28',
    add: 16,
    bad: 2,
  },
  {
    id: 3,
    name: '비매너 플레이어',
    createdBy: '아기사슴설장군',
    createdAt: '2024-10-15',
    add: 112,
    bad: 33,
  },
  {
    id: 4,
    name: '비매너 모음집',
    createdBy: '애니츠의겨울은너무추오',
    createdAt: '2024-11-26',
    add: 133,
    bad: 30,
  },
  {
    id: 5,
    name: '내 블랙리스트',
    createdBy: '낟찔',
    createdAt: '2024-08-23',
    add: 10,
    bad: 1,
  },
  {
    id: 6,
    name: '레이드 빌런',
    createdBy: 'HaeSungs',
    createdAt: '2024-09-19',
    add: 242,
    bad: 50,
  },
  {
    id: 7,
    name: '레이드 빌런',
    createdBy: 'HaeSungs',
    createdAt: '2024-09-19',
    add: 242,
    bad: 50,
  },
  {
    id: 8,
    name: '레이드 빌런',
    createdBy: 'HaeSungs',
    createdAt: '2024-09-19',
    add: 242,
    bad: 50,
  },
  {
    id: 9,
    name: '레이드 빌런',
    createdBy: 'HaeSungs',
    createdAt: '2024-09-19',
    add: 242,
    bad: 50,
  },
];


export const MOCK_PARTY = {
  '아기사슴설장군': {
    "무기레벨": "1683.88",
    "직업각인": "절제",
    "포인트": [
      120,
      96,
      64
    ],
    "고대악세개수": 5,
    "유물악세개수": 0,
    "악세목록": {
      "상특옵개수": 3,
      "상공용개수": 0,
      "중특옵개수": 1,
      "중공용개수": 0,
      "하특옵개수": 0,
      "하공용개수": 0
    },
    "보석": {
      "7레벨 겁화": 4,
      "7레벨 작열": 2,
      "6레벨 겁화": 2,
      "6레벨 작열": 3
    },
    "각인": [
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "기습의 대가",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "돌격대장",
        "어빌리티스톤레벨": 3
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "아드레날린",
        "어빌리티스톤레벨": 1
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "원한",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "저주받은 인형",
        "어빌리티스톤레벨": 0
      }
    ],
    "초월": {
      "투구": 20, 
      "견장": 21, 
      "상의": 21, 
      "하의": 21, 
      "장갑": 21, 
      "무기": 20
    },
    "엘릭서": 40,
    "카드": "세구빛 30각"
  },
  '낟찔': {
    "무기레벨": "1683.88",
    "직업각인": "절제",
    "포인트": [
      120,
      96,
      64
    ],
    "고대악세개수": 5,
    "유물악세개수": 0,
    "악세목록": {
      "상특옵개수": 3,
      "상공용개수": 0,
      "중특옵개수": 1,
      "중공용개수": 0,
      "하특옵개수": 0,
      "하공용개수": 0
    },
    "보석": {
      "7레벨 겁화": 4,
      "7레벨 작열": 2,
      "6레벨 겁화": 2,
      "6레벨 작열": 3
    },
    "각인": [
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "기습의 대가",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "돌격대장",
        "어빌리티스톤레벨": 3
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "아드레날린",
        "어빌리티스톤레벨": 1
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "원한",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "저주받은 인형",
        "어빌리티스톤레벨": 0
      }
    ],
    "초월": {
      "투구": 20, 
      "견장": 21, 
      "상의": 21, 
      "하의": 21, 
      "장갑": 21, 
      "무기": 20
    },
    "엘릭서": 40,
    "카드": "세구빛 30각"
  },
  '수호물': {
    "무기레벨": "1683.88",
    "직업각인": "절제",
    "포인트": [
      120,
      96,
      64
    ],
    "고대악세개수": 5,
    "유물악세개수": 0,
    "악세목록": {
      "상특옵개수": 3,
      "상공용개수": 0,
      "중특옵개수": 1,
      "중공용개수": 0,
      "하특옵개수": 0,
      "하공용개수": 0
    },
    "보석": {
      "7레벨 겁화": 4,
      "7레벨 작열": 2,
      "6레벨 겁화": 2,
      "6레벨 작열": 3
    },
    "각인": [
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "기습의 대가",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "돌격대장",
        "어빌리티스톤레벨": 3
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "아드레날린",
        "어빌리티스톤레벨": 1
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "원한",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "저주받은 인형",
        "어빌리티스톤레벨": 0
      }
    ],
    "초월": {
      "투구": 20, 
      "견장": 21, 
      "상의": 21, 
      "하의": 21, 
      "장갑": 21, 
      "무기": 20
    },
    "엘릭서": 40,
    "카드": "세구빛 30각"
  },
  '애니츠의겨울은너무추오': {
    "무기레벨": "1683.88",
    "직업각인": "절제",
    "포인트": [
      120,
      96,
      64
    ],
    "고대악세개수": 5,
    "유물악세개수": 0,
    "악세목록": {
      "상특옵개수": 3,
      "상공용개수": 0,
      "중특옵개수": 1,
      "중공용개수": 0,
      "하특옵개수": 0,
      "하공용개수": 0
    },
    "보석": {
      "7레벨 겁화": 4,
      "7레벨 작열": 2,
      "6레벨 겁화": 2,
      "6레벨 작열": 3
    },
    "각인": [
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "기습의 대가",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "돌격대장",
        "어빌리티스톤레벨": 3
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "아드레날린",
        "어빌리티스톤레벨": 1
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "원한",
        "어빌리티스톤레벨": null
      },
      {
        "등급": "유물",
        "등급레벨": 0,
        "각인이름": "저주받은 인형",
        "어빌리티스톤레벨": 0
      }
    ],
    "초월": {
      "투구": 20, 
      "견장": 21, 
      "상의": 21, 
      "하의": 21, 
      "장갑": 21, 
      "무기": 20
    },
    "엘릭서": 40,
    "카드": "세구빛 30각"
  }
}